spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_stripe_for_charge_succeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15pihPDOCi1ehaTMV8xyr5a2
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.4
      Authorization:
      - Bearer sk_test_VqQNTdaBK8zAQt7MabYVgkL2
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.4","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"i686-linux","publisher":"stripe","uname":"Linux
        jason-Aspire-X1300 3.16.0-34-generic #45-Ubuntu SMP Mon Mar 23 17:27:54 UTC
        2015 i686 athlon i686 GNU/Linux"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 11 Apr 2015 14:38:31 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1914'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Dpb0xFd40mhfuQo7
      Stripe-Version:
      - '2015-03-24'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15pihPDOCi1ehaTMV8xyr5a2",
          "created": 1428597615,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_15pihPDOCi1ehaTMnmSOmaLQ",
              "object": "charge",
              "created": 1428597615,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 999,
              "currency": "cad",
              "refunded": false,
              "source": {
                "id": "card_15pihODOCi1ehaTMFbdzyK9O",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 4,
                "exp_year": 2015,
                "fingerprint": "H26dOohpCTeoD8lr",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_61mFeUN14moDwK"
              },
              "captured": true,
              "balance_transaction": "txn_15pihPDOCi1ehaTMKhNs9wjN",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_61mFeUN14moDwK",
              "invoice": "in_15pihPDOCi1ehaTMT2TV6hLK",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15pihPDOCi1ehaTMnmSOmaLQ/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_61mFjQfmye2eSm",
          "api_version": "2015-03-24"
        }
    http_version: 
  recorded_at: Sat, 11 Apr 2015 14:38:30 GMT
recorded_with: VCR 2.9.3
